/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   push_swap_rule.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jinsyang <jinsyang@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/02/28 02:37:33 by jinsyang          #+#    #+#             */
/*   Updated: 2023/02/28 05:27:04 by jinsyang         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "push_swap.h"

//- sa : 스택 A의 가장 위에 있는 두 개의 요소를 서로 바꿉니다.
//- sb : 스택 B의 가장 위에 있는 두 개의 요소를 서로 바꿉니다.
//- ss : sa와 sb를 모두 수행합니다.
//- pa : 스택 B의 가장 위에 있는 요소를 스택 A의 가장 위에 넣습니다.
//- pb : 스택 A의 가장 위에 있는 요소를 스택 B의 가장 위에 넣습니다.
//- ra : 스택 A의 모든 요소를 위로 한 칸씩 이동시키고 첫 번째 요소를 마지막에 넣습니다.
//- rb : 스택 B의 모든 요소를 위로 한 칸씩 이동시키고 첫 번째 요소를 마지막에 넣습니다.
//- rr : ra와 rb를 모두 수행합니다.
//- rra : 스택 A의 모든 요소를 아래로 한 칸씩 이동시키고 마지막 요소를 첫 번째에 넣습니다.
//- rrb : 스택 B의 모든 요소를 아래로 한 칸씩 이동시키고 마지막 요소를 첫 번째에 넣습니다.
//- rrr : rra와 rrb를 모두 수행합니다.
//

void	ps_sab(t_list *top)
{
}

void	ps_pab(t_list *top_a, t_list *top_b)
{
}

void	ps_rab(t_list *top)
{
}

void	ps_rrab(t_list *top)
{
}
